Conf.Simple/src/InformationRegisters/SUI_СообщенияОбменаДанными/SUI_СообщенияОбменаДанными.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_СообщенияОбменаДанными</name>
  <resources>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ВидДанных</name>
    <type>
      <types>EnumRef.SUI_ВидыДанныхСообщенийОбменаДанными</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МеткаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сворачивать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ID</name>
    <comment>Идентификатор сообщения</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Отправитель</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/Enums/SUI_ВидыДанныхСообщенийОбменаДанными/SUI_ВидыДанныхСообщенийОбменаДанными.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_ВидыДанныхСообщенийОбменаДанными</name>
  <enumValues>
    <name>Значение</name>
  </enumValues>
  <enumValues>
    <name>JSON</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/InformationRegisters/SUI_СообщенияОбменаДанными/Forms/ФормаЗаписи/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ГраницаПакетов;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Сворачивать.ТолькоПросмотр = (Запись.ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.JSON);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НачатьСборкуПакетовСообщения();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИндексТекущегоПакетаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИндексТекущегоПакета = ИндексТекущегоПакета + Направление;
	ЗагрузитьПакетДанныхНаФорму();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НачатьСборкуПакетовСообщения()
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("НачатьСборкуПакетовСообщенияЗавершение", ЭтотОбъект);

	Результат = НачатьСборкуПакетовСобщенияНаСервере();
	
	Если Результат.Свойство("ДлительнаяОперация") Тогда
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.Заголовок = НСтр("ru = 'Сборка пакетов данных сообщения обмена'");
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(Результат.ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
		
	ИначеЕсли ЗначениеЗаполнено(Результат) Тогда
		ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НачатьСборкуПакетовСобщенияНаСервере()
	
	Результат = Новый Структура();
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	SUI_СообщенияОбменаДанными.Данные
		|ИЗ
		|	РегистрСведений.SUI_СообщенияОбменаДанными КАК SUI_СообщенияОбменаДанными
		|ГДЕ
		|	SUI_СообщенияОбменаДанными.ID = &ID
		|	И SUI_СообщенияОбменаДанными.Отправитель = &Отправитель
		|	И SUI_СообщенияОбменаДанными.Получатель = &Получатель";
	
	Запрос.УстановитьПараметр("ID", Запись.ID);
	Запрос.УстановитьПараметр("Отправитель", Запись.Отправитель);
	Запрос.УстановитьПараметр("Получатель", Запись.Получатель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
	
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Данные = Выборка.Данные.Получить();
		
		Если Запись.ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.JSON Тогда
			
			Данные = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Данные);
			
			Результат.Вставить("Статус", "Выполнено");
			Результат.Вставить("АдресРезультата", ПоместитьВоВременноеХранилище(Данные, УникальныйИдентификатор));
			
		Иначе
			
			Если SUI_СообщенияОбменаДанными.ЭтоСообщениеОперации(Данные) Тогда
				
				Данные = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
					SUI_СообщенияОбменаДанными.ПредставлениеСодержимогоСообщенияОперации(Данные));
			
				Результат.Вставить("Статус", "Выполнено");
				Результат.Вставить("АдресРезультата", ПоместитьВоВременноеХранилище(Данные, УникальныйИдентификатор));
				
			Иначе
				
				ПараметрыСборки = SUI_ПакетыДанных.ПараметрыСборкиСообщенийПакетаДанныхИзКоллекции(Данные);
				ЗаполнитьЗначенияСвойств(ПараметрыСборки, Запись);
				ПараметрыСборки.ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.JSON;
				
				ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне("SUI_ПакетыДанных.СобратьСообщениеПакетаДанныхИзКоллекции",
					ПараметрыСборки, 
					ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор));
				
				Результат.Вставить("ДлительнаяОперация", ДлительнаяОперация);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура НачатьСборкуПакетовСообщенияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Свойство("КраткоеПредставлениеОшибки") И ЗначениеЗаполнено(Результат.КраткоеПредставлениеОшибки) Тогда
		ПоказатьПредупреждение(, Результат.КраткоеПредставлениеОшибки);
		Если Результат.Свойство("ПодробноеПредставлениеОшибки") И ЗначениеЗаполнено(Результат.ПодробноеПредставлениеОшибки) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
		КонецЕсли;
	КонецЕсли;
	
	Если Результат.Свойство("Сообщения") И ЗначениеЗаполнено(Результат.Сообщения) Тогда
		
		Для Каждого Сообщение Из Результат.Сообщения Цикл
			Сообщение.Сообщить();
		КонецЦикла;
		
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		ОписаниеТипаМассив = Новый ОписаниеТипов("Массив");
		ПакетыСообщения.ЗагрузитьЗначения(ОписаниеТипаМассив.ПривестиЗначение(ПолучитьИзВременногоХранилища(Результат.АдресРезультата)));
	Иначе
		ПакетыСообщения.Очистить();
	КонецЕсли;
	
	ГраницаПакетов = ПакетыСообщения.Количество()-1;
	
	ИндексТекущегоПакета = 0;
	
	ЗагрузитьПакетДанныхНаФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПакетДанныхНаФорму()
	
	Если ГраницаПакетов >= 0 Тогда
		
		Если ИндексТекущегоПакета < 0 Тогда
			ИндексТекущегоПакета = 0;
		ИначеЕсли ИндексТекущегоПакета > ГраницаПакетов Тогда
			ИндексТекущегоПакета = ГраницаПакетов;
		КонецЕсли;
		
		Сообщение = ПакетыСообщения[ИндексТекущегоПакета].Значение;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
